Revit 2018 API
VertexPositionNormalColored Class
 A geometry vertex specified as a position in space with a normal vector and a color.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2017
Syntax
C#
public class VertexPositionNormalColored : Vertex
Visual Basic
Public Class VertexPositionNormalColored _
	Inherits Vertex
Visual C++
public ref class VertexPositionNormalColored : public Vertex
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.Vertex
 Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored
See Also
VertexPositionNormalColored Members
Autodesk.Revit.DB.DirectContext3D Namespace